sml2D8/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inletBottom
    {
        type            patch;
        nFaces          5;
        startFace       750;
    }
    inletTop
    {
        type            patch;
        nFaces          5;
        startFace       755;
    }
    outletBottom
    {
        type            patch;
        nFaces          5;
        startFace       760;
    }
    outletTop
    {
        type            patch;
        nFaces          5;
        startFace       765;
    }
    bottom
    {
        type            patch;
        nFaces          40;
        startFace       770;
    }
    top
    {
        type            patch;
        nFaces          40;
        startFace       810;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          800;
        startFace       850;
    }
)

// ************************************************************************* //
